<?php
/**
 * Created by PhpStorm.
 * User: Ishchishin
 * Date: 28.11.2016
 * Time: 1:18
 * Дано число $n = 1000. Делите его на 2 столько раз, пока результат деления не станет
 * меньше 50. Какое число получится? Посчитайте количество итераций, необходимых для
 * этого (итерации — это количество проходов цикла), и запишите его в переменную $num.</p>
 */


$n = 1000;
$num=0;
while ($n>=50){
   $num++;
   $n=$n/2;
 echo "<pre>";
 echo $n;
 echo "</pre>";
}
echo "итерации — ".$num;
echo "</pre>";

?>
